# -*- coding: utf-8 -*-

helpText = '/help - выводит этот текст\n/book - переходит к рекомендации книг'
startText = 'Этот бот предназначен для получения жанровых рекомендаций книг из базы Фантлаба (https://fantlab.ru/). Для начала работы наберите команду /book или нажмите на кнопку внизу'
botErrorText = 'Произошла ошибка. Пожалуйста, начните работу с ботом заново и сообщите разработчику о случившемся.'
pleaseWaitText = "Пожалуйста, подождите, выбираем книгу специально для вас..."
showRecomendsText = "Перейти к рекомендациям"
iwantmoreText = "Хочу еще такого же"
startagainText= "Не, давай по новой"

requestStepsArray = [
	[
		["Фэнтези", "wg19=on", 0], 
		["Фантастика", "wg1=on", 0],
		['Не важно', "NONE", 0]
	],
	[
		["На Земле", "&wg69=on&wg89=on", 1], 
		["Где-то в другом мире", "&wg78=on&wg88=on&wg91=on&wg92=on&wg129=on&wg213=on", 1],
		['Не важно', "NONE", 1]
	], 
	[
		["Далеко в прошлом", "&wg93=on&wg94=on&wg95=on&wg96=on&wg97=on&wg98=on&wg99=on", 2], 
		["В наши дни", "&wg100=on&wg101=on", 2],
		["В будущем", "&wg102=on&wg103=on&wg104=on", 2],
		['Не важно', "NONE", 2]
	],
	[
		["Наши", "&lang=rus", 3], 
		["Зарубежные", "&lang=for", 3],
		['Не важно', "NONE", 3]
	],
	[
		["Роман", "&form=nov", 4], 
		["Повесть или рассказ", "&form=sto", 4],
		['Не важно', "NONE", 4]
	]
]
	
requestNamesArray = ["Что читаем?", "Где разворачивается действие?", "Когда происходят события?", "И кто же авторы?", "А размер имеет значение?"]

fixRequestString = "wg1=on&wg19=on&wg33=on&wg30=on&wg31=on&wg32=on&wg34=on&wg35=on&wg225=on&wg36=on&wg37=on&wg38=on&wg39=on&wg160=on&wg116=on&lang=&form="
